Revit 2027 API
FabricationNetworkChangeService.SetMapOfSizesForStraights Method
 Set the mapping for sizes of fabrication part straights to change the sizes to.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMapOfSizesForStraights(
	ISet<FabricationPartSizeMap> fabricationPartSizeMaps
)
Public Sub SetMapOfSizesForStraights (
	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap)
)
public:
void SetMapOfSizesForStraights(
	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps
)
member SetMapOfSizesForStraights :
        fabricationPartSizeMaps : ISet<FabricationPartSizeMap> -> unit
Parameters
fabricationPartSizeMaps ISet<FabricationPartSizeMap>
 The map containing the original straights size to the mapped sizes.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace